## gateway-dev
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.gateway_app.digitalocean_app.app will be created
  + resource "digitalocean_app" "app" {
      + active_deployment_id = (known after apply)
      + created_at           = (known after apply)
      + default_ingress      = (known after apply)
      + deployment_per_page  = 20
      + id                   = (known after apply)
      + live_domain          = (known after apply)
      + live_url             = (known after apply)
      + project_id           = "8a8c246e-2057-46b7-a01a-04cbbbf0b8d9"
      + updated_at           = (known after apply)
      + urn                  = (known after apply)

      + dedicated_ips (known after apply)

      + spec {
          + disable_edge_cache              = false
          + disable_email_obfuscation       = false
          + domains                         = (known after apply)
          + enhanced_threat_control_enabled = false
          + features                        = (known after apply)
          + name                            = "gateway"
          + region                          = "fra1"

          + domain (known after apply)

          + ingress (known after apply)

          + service {
              + http_port          = (known after apply)
              + instance_count     = 1
              + instance_size_slug = "s-1vcpu-1gb"
              + internal_ports     = (known after apply)
              + name               = "web-service"
              + run_command        = (known after apply)

              + env {
                  # At least one attribute in this block is (or was) sensitive,
                  # so its contents will not be displayed.
                }

              + image {
                  + registry_type = "DOCR"
                  + repository    = "mesazon-gateway-core"
                  + tag           = "pr-169-b42cb0b"

                  + deploy_on_push (known after apply)
                }

              + routes (known after apply)
            }
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>